app/views/bookings/_form.html.erb

  <%= f.label :computer_id %><br />
  <%= f.collection_select :computer_id, Computer.all, :id, :total_computer, {:prompt   => "Select a computer"} %>
---
SELECT "computers".* FROM "computers"

  <%= f.label :timeunit_id %><br />
  <%= f.collection_select :timeunit_id, Timeunit.all, :id, :id, {:prompt   => "Select a time unit"} %>
---
SELECT "timeunits".* FROM "timeunits"