app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.all
---
SELECT "bookings".* FROM "bookings" WHERE (student_id = 1)

  def show
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 1) LIMIT 1

  def edit
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 3) LIMIT 1

  def create
    @booking = Booking.new(params[:booking])

    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("timeunit_id", "student_id", "date", "created_at", "computer_id", "updated_at") VALUES (11, NULL, '2010-12-22', '2010-12-22 18:44:15.530948', 6, '2010-12-22 18:44:15.530948') RETURNING "id"

  def update
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 3) LIMIT 1

  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy
---
SELECT "bookings".* FROM "bookings" WHERE ("bookings"."id" = 13) LIMIT 1
DELETE FROM "bookings" WHERE ("bookings"."id" = 13)