app/controllers/computers_controller.rb

SELECT "computers".* FROM "computers"
---
  def index
    @computers = Computer.all

SELECT "computers".* FROM "computers" WHERE ("computers"."id" = 1) LIMIT 1
---
  def show
    @computer = Computer.find(params[:id])

SELECT "computers".* FROM "computers" WHERE ("computers"."id" = 5) LIMIT 1
---
  def edit
    @computer = Computer.find(params[:id])

INSERT INTO "computers" ("updated_at", "room_id", "block_id", "number", "created_at", "name") VALUES ('2010-12-22 22:47:30.826621', 14, NULL, 2, '2010-12-22 22:47:30.826621', NULL) RETURNING "id"
---
  def create
    @computer = Computer.new(params[:computer])

    respond_to do |format|
      if @computer.save

SELECT "computers".* FROM "computers" WHERE ("computers"."id" = 17) LIMIT 1
---
  def update
    @computer = Computer.find(params[:id])

SELECT "computers".* FROM "computers" WHERE ("computers"."id" = 1) LIMIT 1
DELETE FROM "computers" WHERE ("computers"."id" = 1)
---
  def destroy
    @computer = Computer.find(params[:id])
    @computer.destroy