app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE ("rooms"."id" = 1) LIMIT 1
---
  def show
    @room = Room.find(params[:id])

SELECT "blocks".* FROM "blocks"
---
  def new
    @room = Room.new
    @blocks = Block.all

SELECT "rooms".* FROM "rooms" WHERE ("rooms"."id" = 1) LIMIT 1
SELECT "blocks".* FROM "blocks"
---
  def edit
    @room = Room.find(params[:id])
    #block = Block.find_by_id(@room.block_id)
    #@room.name = "Block:#{block.name},Room:#{@room.name}"
    @blocks = Block.all

INSERT INTO "rooms" ("block_id", "name", "created_at", "updated_at") VALUES (2, 'Block:B10,Room:fafeeffw', '2010-12-22 21:57:40.889585', '2010-12-22 21:57:40.889585') RETURNING "id"
---
  def create
    @room = Room.new(params[:room])
    #block = Block.find_by_id(@room.block_id)
    #@room.name = "Block:#{block.name},Room:#{@room.name}"

    respond_to do |format|
      if @room.save

SELECT "rooms".* FROM "rooms" WHERE ("rooms"."id" = 3) LIMIT 1
UPDATE "rooms" SET "updated_at" = '2010-12-20 16:59:34.536846', "name" = 'computerlab1' WHERE ("rooms"."id" = 3)
---
  def update
    @room = Room.find(params[:id])

    respond_to do |format|
      if @room.update_attributes(params[:room])

SELECT "rooms".* FROM "rooms" WHERE ("rooms"."id" = 8) LIMIT 1
DELETE FROM "rooms" WHERE ("rooms"."id" = 8)
---
  def destroy
    @room = Room.find(params[:id])
    @room.destroy