app/controllers/student_sessions_controller.rb

SELECT "students".* FROM "students" WHERE ("students"."email" = 'pedroherub@gmail.com') LIMIT 1
---
  def create
    @student_session = StudentSession.new(params[:student_session])
    student = Student.find_by_email(@student_session.email)