app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 2) LIMIT 1

  def edit
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("email", "name", "crypted_password", "password_salt", "persistence_token", "created_at", "studentid", "updated_at") VALUES ('pedroherub@gmail.com', 'Pedro Hernández', '2637984236628850bf8a37d5ecc6d8e5c1a4e2c00675aec346005020b61ea7449f7e98620d032ae2f59a63999684e662c08949c5a9157a7088c9ed08f01d17a0', 'Cp4mpXMC7i8oZnPHuozY', '1ef5436f7aa125976c73cffb0b85f5e19677c5e742358eb55f5259b677a994254d42745569e3b28a97c0690f1e7062b6848e6999394fbd98f37f8a689137f184', '2010-12-13 18:39:42.234794', 12345678, '2010-12-13 18:39:42.234794') RETURNING "id"

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT "students"."id" FROM "students" WHERE ("students"."studentid" = 12345678) AND ("students".id <> 4) LIMIT 1
UPDATE "students" SET "crypted_password" = '695290766708fd5de831997d4fd35bb61c69078ab211f9dae3b96f24a36d6011dc99ca26a0eb246a1a4ccfb0710ce87b8bd6efc5918a9721b6a4a03668d51a93', "updated_at" = '2010-12-17 08:15:50.053587', "password_salt" = 'mAAW2mUSn0yc0tJv4kcj', "persistence_token" = 'e9e8631bfbde5a15d326bb72ed81bdfd72b614f3356a7f855ff0c6ba64185d9f2ec70a5ff31c7b7073fc7fbf839b95c84489b20f4bbb604bc2265d2166e5b7e4' WHERE ("students"."id" = 4)

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1
DELETE FROM "students" WHERE ("students"."id" = 1)