app/controllers/timeunits_controller.rb

SELECT "timeunits".* FROM "timeunits"
---
  def index
    @timeunits = Timeunit.all

SELECT "timeunits".* FROM "timeunits" WHERE ("timeunits"."id" = 1) LIMIT 1
---
  def show
    @timeunit = Timeunit.find(params[:id])

SELECT "timeunits".* FROM "timeunits" WHERE ("timeunits"."id" = 1) LIMIT 1
---
  def edit
    @timeunit = Timeunit.find(params[:id])

INSERT INTO "timeunits" ("updated_at", "timein", "timeout", "created_at") VALUES ('2010-12-20 17:16:31.710490', '2010-12-20 06:30:00.000000', '2010-12-20 07:15:00.000000', '2010-12-20 17:16:31.710490') RETURNING "id"
---
  def create
    @timeunit = Timeunit.new(params[:timeunit])

    respond_to do |format|
      if @timeunit.save

SELECT "timeunits".* FROM "timeunits" WHERE ("timeunits"."id" = 1) LIMIT 1
---
  def update
    @timeunit = Timeunit.find(params[:id])

SELECT "timeunits".* FROM "timeunits" WHERE ("timeunits"."id" = 1) LIMIT 1
DELETE FROM "timeunits" WHERE ("timeunits"."id" = 1)
---
  def destroy
    @timeunit = Timeunit.find(params[:id])
    @timeunit.destroy